
&НаКлиенте
Процедура Расш1255_Расш1255_ИспользоватьТоварыДляПечатиПриИзмененииПосле(Элемент)
	Элементы.ГруппаТоварыДляПечати.Видимость = Объект.Расш1255_ИспользоватьТоварыДляПечати;
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_ПриОткрытииПосле(Отказ)
	Элементы.ГруппаТоварыДляПечати.Видимость = Объект.Расш1255_ИспользоватьТоварыДляПечати;
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_ВставитьСтрокиДляПечатиПосле(Команда)
	Расш1255_ВставитьСтрокиДляПечатиПослеНаСервере();
	Расш1255_ПересчитатьПодвал();
КонецПроцедуры 

&НаСервере
Процедура Расш1255_ВставитьСтрокиДляПечатиПослеНаСервере()
	Колонки = "Номенклатура,КоличествоУпаковок,Цена";
    ПараметрыОтбора = Неопределено;
	ТаблицаТоваров = РаботаСТабличнымиЧастями.СтрокиИзБуфераОбмена(ПараметрыОтбора, Колонки);
	
	Если ТаблицаТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		ТекущаяСтрока = Объект.Расш1255_ТоварыДляПечати.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
		ТекущаяСтрока.Сумма = СтрокаТовара.КоличествоУпаковок * СтрокаТовара.Цена;
		ТекущаяСтрока.Упаковка = ТекущаяСтрока.Номенклатура.ЕдиницаИзмерения;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_Расш1255_ТоварыДляПечатиКоличествоУпаковокПриИзмененииПосле(Элемент)
	Расш1255_КоличествоЦенаПриИзменении()
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_Расш1255_ТоварыДляПечатиЦенаПриИзмененииПосле(Элемент)
	Расш1255_КоличествоЦенаПриИзменении()
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_КоличествоЦенаПриИзменении()
	
	ТекСтрока = Элементы.Расш1255_ТоварыДляПечати.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.КоличествоУпаковок * ТекСтрока.Цена;
	Расш1255_ПересчитатьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_Расш1255_ТоварыДляПечатиСуммаПриИзмененииПосле(Элемент)
	ТекСтрока = Элементы.Расш1255_ТоварыДляПечати.ТекущиеДанные;
	Если ТекСтрока.КоличествоУпаковок <> 0 Тогда
		ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.КоличествоУпаковок; 
		Расш1255_ПересчитатьПодвал();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура Расш1255_ПересчитатьПодвал()
	Элементы.Расш1255_ТоварыДляПечатиНоменклатура.ТекстПодвала = Объект.Товары.Итог("Сумма") - Объект.Расш1255_ТоварыДляПечати.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура Расш1255_Расш1255_ТоварыДляПечатиНоменклатураПриИзмененииПосле(Элемент)
	ТекСтрока = Элементы.Расш1255_ТоварыДляПечати.ТекущиеДанные;
	Если НЕ ТекСтрока.Номенклатура.Пустая() Тогда
		ТекСтрока.Упаковка = Расш1255_ПолучитьУпаковкуНаСервере(ТекСтрока.Номенклатура);
	КонецЕсли;
КонецПроцедуры  

&НаСервереБезКонтекста
Функция Расш1255_ПолучитьУпаковкуНаСервере(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЕдиницаИзмерения;
	КонецЕсли;
	Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
КонецФункции

